a = [153,152,156,160,140,134,157,159,153,152,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151,151]

# Правило Стека:
# 1) Ограниченный буфер (для нас сделаем: len(a) <= 10)

#while True:
#    a = a[-10::]
#    a.append(int(input("Новое число: ")))
#    print(int(sum(a)/len(a)))


######### Батчинг данных
# Есть объём батча и лимит батчей
BATCH_LIMIT = 16
BATCH_VOLUME = 5
batches = []


for i in range(0,len(a)-BATCH_VOLUME, BATCH_VOLUME):
    batch = a[i:i+BATCH_VOLUME]
    batches.append(batch)

    if len(batches) <= BATCH_LIMIT:break

